# The dataset used for this Activity is downloaded from Kaggle : https://www.kaggle.com/datasets/smeet888/global-air-quality-data15-days-hourly-50-cities

In [2]:
import pandas as pd

In [7]:
#Let's work with AQI Dataset

#step 01 -> Load the .csv file
df = pd.read_csv("globalAirQuality.csv")
df.describe()
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18000 entries, 0 to 17999
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   timestamp    18000 non-null  object
 1   country      18000 non-null  object
 2   city         18000 non-null  object
 3   latitude     18000 non-null  float64
 4   longitude    18000 non-null  float64
 5   pm25         18000 non-null  float64
 6   pm10         18000 non-null  float64
 7   no2          18000 non-null  float64
 8   so2          18000 non-null  float64
 9   o3           18000 non-null  float64
 10  co           18000 non-null  float64
 11  aqi          18000 non-null  int64
 12  temperature  18000 non-null  float64
 13  humidity     18000 non-null  float64
 14  wind_speed   18000 non-null  float64
dtypes: float64(11), int64(1), object(3)
memory usage: 2.1+ MB

In [ ]:
#Selecting the data
#Accessing the values of particular columns
df.columns
print(df['country'])
print(df[["city", "country"]])#Case-sensitive

0        US
1        US
2        US
3        US
4        US
         ..
17995    CH
17996    CH
17997    CH
17998    CH
17999    CH
Name: country, Length: 18000, dtype: object
           city country
0      New York      US
1      New York      US
2      New York      US
3      New York      US
4      New York      US
...         ...     ...
17995    Zurich      CH
17996    Zurich      CH
17997    Zurich      CH
17998    Zurich      CH
17999    Zurich      CH

[18000 rows x 2 columns]

## To access the rows in dataframe => Through Label & Index based - loc & iloc
### location and index location

In [17]:
df.loc[0]
df.loc[900:1000] #start idx : end idx (inclusive)

,timestamp,country,city,latitude,longitude,pm25,pm10,no2,so2,o3,co,aqi,temperature,humidity,wind_speed
900,2025-11-12 06:25:17.554219,GB,London,51.507,-0.128,14.999,63.726,1.549,4.642,51.600,1.015,63,9.846,58.135,4.078
901,2025-11-12 07:25:17.554219,GB,London,51.507,-0.128,82.166,85.047,52.161,8.042,64.178,1.098,164,22.511,76.505,7.545
902,2025-11-12 08:25:17.554219,GB,London,51.507,-0.128,25.546,69.301,33.964,8.063,38.550,1.076,84,8.041,35.509,0.635
903,2025-11-12 09:25:17.554219,GB,London,51.507,-0.128,34.183,30.455,35.484,5.414,27.053,0.752,88,8.802,41.460,2.540
904,2025-11-12 10:25:17.554219,GB,London,51.507,-0.128,34.639,33.362,49.723,7.571,30.339,0.976,124,16.947,43.458,8.941
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
996,2025-11-16 06:25:17.554219,GB,London,51.507,-0.128,62.001,51.305,12.357,5.224,85.792,0.604,124,36.769,35.229,3.550
997,2025-11-16 07:25:17.554219,GB,London,51.507,-0.128,4.608,40.387,4.501,6.388,25.951,0.699,40,14.844,42.225,8.655
998,2025-11-16 08:25:17.554219,GB,London,51.507,-0.128,34.055,84.315,33.183,6.698,55.141,1.107,84,26.288,58.278,2.920
999,2025-11-16 09:25:17.554219,GB,London,51.507,-0.128,20.167,49.795,25.471,5.265,61.559,0.577,63,23.448,62.426,1.415
1000,2025-11-16 10:25:17.554219,GB,London,51.507,-0.128,49.991,88.157,26.399,6.280,32.126,0.732,99,5.184,49.386,8.332

In [ ]:
df.iloc[0]
df.iloc[0:2]#the ending idx in exclusive with iloc

,timestamp,country,city,latitude,longitude,pm25,pm10,no2,so2,o3,co,aqi,temperature,humidity,wind_speed
0,2025-11-04 18:25:17.554219,US,New York,40.713,-74.006,50.295,108.938,27.998,6.539,52.568,1.096,108,18.504,70.168,3.725
1,2025-11-04 19:25:17.554219,US,New York,40.713,-74.006,32.083,63.043,36.120,4.021,43.536,1.075,90,5.838,80.088,8.969

### How do I access the individual cell values in the dataframe?

In [33]:
#loc function can be used  for the above purpose
#cell -> row, col
print(df.loc[1457, ["city","aqi"]])
print(df.loc[0:100, ["city","aqi"]])

city    Berlin
aqi        100
Name: 1457, dtype: object
         city  aqi
0    New York  108
1    New York   90
2    New York   84
3    New York  158
4    New York   97
..        ...  ...
96   New York   93
97   New York   88
98   New York  113
99   New York   57
100  New York   89

[101 rows x 2 columns]

### iloc[] works with indexes, so even columns should be passed as their respective indexes
### It won't work with column names

In [39]:
df.iloc[1000:1250, 2]
df.loc[0:2, ["country", "city", "latitude", "longitude"]]
df.iloc[0:3, 1:5]

  country      city  latitude  longitude
0      US  New York    40.713    -74.006
1      US  New York    40.713    -74.006
2      US  New York    40.713    -74.006

### To acccess individual cell names, we can use at and iat

In [47]:
print(df.at[0, "city"])
print(df.iat[0,2])

New York
New York

## The dataframe methods used above create only a view and not a copy, excatly as in numpy

## To prevent accidental changes in the original data, uses copy chaining
df["city"].copy(), create a copy and then make changes, this way original data will remain unchanged